src/cf/InformationRegisters/ЖурналЗагрузкиЕНС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЖурналЗагрузкиЕНС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ЖурналЗагрузкиЕНС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

Процедура ПолучитьЗапись(ПараметрыЗаписи) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.ЖурналЗагрузкиЕНС.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Организация    = ПараметрыЗаписи.Организация;
	МенеджерЗаписи.ДатаВыполнения = ПараметрыЗаписи.ДатаВыполнения;
	МенеджерЗаписи.Прочитать();
	
	ДанныеИзХранилища = МенеджерЗаписи.Содержание.Получить();
	Если ТипЗнч(ДанныеИзХранилища) <> Тип("ДвоичныеДанные") Тогда
		Попытка
			ДанныеИзХранилища = ПолучитьДвоичныеДанныеИзСтроки(Строка(ДанныеИзХранилища));
		Исключение
			ДанныеИзХранилища = ПолучитьДвоичныеДанныеИзСтроки(Строка(ТипЗнч(ДанныеИзХранилища)));
		КонецПопытки;
	КонецЕсли;
	ПоместитьВоВременноеХранилище(ПолучитьBase64СтрокуИзДвоичныхДанных(ДанныеИзХранилища), ПараметрыЗаписи.АдресХранилища);
	
	ПараметрыЗаписи.ИмяФайла = СтрШаблон(ШаблонИмениФайлаЗаписи(),
		СтрЗаменить(Формат(ПараметрыЗаписи.ДатаВыполнения, "ДЛФ=D"), ".", ""),
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыЗаписи.Организация, "ИНН"));
	
КонецПроцедуры

Функция ПараметрыПолученияЗаписи() Экспорт
	
	ПараметрыЗаписи = Новый Структура();
	ПараметрыЗаписи.Вставить("Организация");
	ПараметрыЗаписи.Вставить("ДатаВыполнения");
	ПараметрыЗаписи.Вставить("АдресХранилища");
	ПараметрыЗаписи.Вставить("ИмяФайла");
	
	Возврат ПараметрыЗаписи;
	
КонецФункции

Функция ШаблонИмениФайлаЗаписи() Экспорт
	
	Шаблон = "reglog_d%1_i%2.txt";
	
	Возврат Шаблон;
	
КонецФункции

#КонецОбласти

#КонецЕсли
